<?php

// +----------------------------------------------------------------------
// | 审批类型
// +----------------------------------------------------------------------

return [
    // 审批类型
    'type'  => [
		[
			'id' => '1',
			'title'=> '假勤',
			'db_type'=>1,
			'db_name'=>'',
        ],
		 [
			'id' => '2',
			'title'=> '行政',
			'db_type'=>1,
			'db_name'=>'',			
        ],
		[
			'id' => '3',
			'title'=> '财务',
			'db_type'=>1,
			'db_name'=>'',			
        ],
		[
			'id' => '4',
			'title'=> '人事',
			'db_type'=>1,
			'db_name'=>'',            
        ],
		[
			'id' => '5',
			'title'=> '其他',
			'db_type'=>1,
			'db_name'=>'',			
        ],
		[
			'id' => '6',
			'title'=> '报销' ,
			'db_type'=>2,
			'db_name'=>'',			
        ],
		[
			'id' => '7',
			'title'=> '发票',
			'db_type'=>3,
			'db_name'=>'',			
        ],
		[
			'id' => '8',
			'title'=> '合同',
			'db_type'=>4,
			'db_name'=>'',            
        ],
	],
];
