<?php

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 系统消息模板
    'template'  => [
        1 => [
			'name'       => '公告',
            'template' => '您有一个新公告：{title} ，请及时查看。',
        ],
        2 => [
			'type'       => '报销审批',
            'template' => '{from_user} 提交 {title} 报销审批，请及时处理。',
        ],
        3 => [
			'type'       => '报销审批',
            'template' => '{from_user} 拒绝您的 {title} 报销审批，拒绝理由：{remark}，请及时处理。',
        ],
        4 => [
			'type'       => '报销审批',
            'template' => '您的 {title} 报销已经审批通过，请及时查看。',
        ],
        5 => [
			'type'       => '报销发放',
            'template' => '您的 {title} 报销已经发放，请查看是否到账。',
        ],
        6 => [
			'type'       => '发票审批',
            'template' => '{from_user} 提交 {title} 发票审批待您处理，请及时查看。',
        ],
        7 => [
			'type'       => '发票审批',
            'template' => '{from_user} 拒绝您的 {title} 发票审批，请及时处理。',
        ],
        8 => [
			'type'       => '发票审批',
            'template' => '您的 {title} 发票已经审批通过，请及时查看。',
        ],
        9 => [
			'type'       => '发票审批',
            'template' => '您的 {title} 发票已经开票成功，请及时查看。',
        ],
    ],
];
