<?php
/**
+-----------------------------------------------------------------------------------------------
* GouGuOPEN [ 左手研发，右手开源，未来可期！]
+-----------------------------------------------------------------------------------------------
* @Copyright (c) http://www.gouguoa.com All rights reserved.
+-----------------------------------------------------------------------------------------------
* @Licensed 勾股OA，开源且可免费使用，但并不是自由软件，未经授权许可不能去除勾股OA的相关版权信息
+-----------------------------------------------------------------------------------------------
* @Author 勾股工作室 <hdm58@qq.com>
+-----------------------------------------------------------------------------------------------
*/

use think\facade\Db;
//获取绩效状态
function get_status($id=0)
{
	$status_array = ['待发布绩效单','待填写','待审核','审核不通过','已审核'];
	if($id==0){
		return $status_array;
	}
	else{
		$news_array=[];
		foreach($status_array as $key => $value){
			if($key>0){
				$news_array[]=array(
					'id'=>$key,
					'title'=>$value,
				);
			}
		}
		return $news_array;
	}
}

//根据状态读取审批状态名称
function status_name($status=0)
{
	$status_array = get_status();
	return $status_array[$status];
}